burakenez/gd32h7xx-cmake-vscode/Examples/RTDEC/OSPI_data_read_with_RTDEC/Application/Core/Src/ospi_operation.c
    /* initialize the parameters of OSPI struct with default values */
    ospi_struct_init(ospi_struct);

    ospi_struct->prescaler         = 9U;
    ospi_struct->sample_shift      = OSPI_SAMPLE_SHIFTING_NONE;
    ospi_struct->fifo_threshold    = OSPI_FIFO_THRESHOLD_5;
    ospi_struct->device_size       = OSPI_MESZ_4096_MBS;
    ospi_struct->wrap_size         = OSPI_DIRECT;
    ospi_struct->cs_hightime       = OSPI_CS_HIGH_TIME_3_CYCLE;
    ospi_struct->memory_type       = OSPI_MICRON_MODE;
    ospi_struct->delay_hold_cycle  = OSPI_DELAY_HOLD_NONE;

    /* initialize OSPI parameter */
    ospi_init(ospi_periph, ospi_struct);
    /* enable OSPI */
    ospi_enable(ospi_periph);
}

/*!
    \brief      read the flah id
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
                prescaler: between 0 and 255
                fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
                sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
                device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
                cs_hightime: OSPI_CS_HIGH_TIME_x_CYCLE (x = 1, 2, ..., 63, 64)
                memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                             OSPI_MACRONIX_RAM_MODE,
                wrap_size: OSPI_DIRECT, OSPI_WRAP_16BYTES, OSPI_WRAP_32BYTES
                           OSPI_WRAP_64BYTES, OSPI_WRAP_128BYTES
                delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
    \retval     none
*/
uint32_t ospi_flash_read_id(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct)
{
    uint8_t temp_id[4];
    ospi_regular_cmd_struct cmd_struct = {0};

    /* initialize read ID command */
    cmd_struct.operation_type          = OSPI_OPTYPE_COMMON_CFG;
    cmd_struct.instruction             = GD25LX512ME_READ_ID_CMD;

    cmd_struct.ins_mode                = OSPI_INSTRUCTION_1_LINE;
    cmd_struct.ins_size                = OSPI_INSTRUCTION_8_BITS;

    cmd_struct.addr_mode               = OSPI_ADDRESS_NONE;
    cmd_struct.addr_size               = OSPI_ADDRESS_24_BITS;
    cmd_struct.addr_dtr_mode           = OSPI_ADDRDTR_MODE_DISABLE;

    cmd_struct.alter_bytes_mode        = OSPI_ALTERNATE_BYTES_NONE;
    cmd_struct.alter_bytes_size        = OSPI_ALTERNATE_BYTES_24_BITS;
    cmd_struct.alter_bytes_dtr_mode    = OSPI_ABDTR_MODE_DISABLE;

    cmd_struct.data_mode               = OSPI_DATA_1_LINE;
    cmd_struct.data_dtr_mode           = OSPI_DADTR_MODE_DISABLE;

    cmd_struct.dummy_cycles            = OSPI_DUMYC_CYCLES_0;
    cmd_struct.nbdata = 4;

    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);

    /* receive data */
    ospi_receive(ospi_periph, temp_id);
    return (temp_id[0] << 24) | (temp_id[1] << 16) | (temp_id[2] << 8) | temp_id[3];
}

/*!
    \brief      enable flash memory reset
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
                prescaler: between 0 and 255
                fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
                sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
                device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
                cs_hightime: OSPI_CS_HIGH_TIME_x_CYCLE (x = 1, 2, ..., 63, 64)
                memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                             OSPI_MACRONIX_RAM_MODE,
                wrap_size: OSPI_DIRECT, OSPI_WRAP_16BYTES, OSPI_WRAP_32BYTES
                           OSPI_WRAP_64BYTES, OSPI_WRAP_128BYTES
                delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
    \param[in]  mode: flash interface mode
                only one parameter can be selected which is shown as below:
      \arg        SPI_MODE: SPI mode
      \arg        OSPI_MODE: OSPI mode
    \param[out] none
    \retval     none
*/
void ospi_flash_reset_enable(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, interface_mode mode)
{
    ospi_regular_cmd_struct cmd_struct = {0};

    /* initialize enable flash reset command */
    cmd_struct.operation_type          = OSPI_OPTYPE_COMMON_CFG;
    cmd_struct.instruction             = GD25LX512ME_RESET_ENABLE_CMD;

    /* initialize flash reset command */
    if(SPI_MODE == mode) {
        cmd_struct.ins_mode = OSPI_INSTRUCTION_1_LINE;
    } else {
        cmd_struct.ins_mode = OSPI_INSTRUCTION_8_LINES;
    }

    cmd_struct.ins_size                = OSPI_INSTRUCTION_8_BITS;

    cmd_struct.addr_mode               = OSPI_ADDRESS_NONE;
    cmd_struct.addr_size               = OSPI_ADDRESS_24_BITS;
    cmd_struct.addr_dtr_mode           = OSPI_ADDRDTR_MODE_DISABLE;

    cmd_struct.alter_bytes_mode        = OSPI_ALTERNATE_BYTES_NONE;
    cmd_struct.alter_bytes_size        = OSPI_ALTERNATE_BYTES_24_BITS;
    cmd_struct.alter_bytes_dtr_mode    = OSPI_ABDTR_MODE_DISABLE;

    cmd_struct.data_mode               = OSPI_DATA_NONE;
    cmd_struct.data_dtr_mode           = OSPI_DADTR_MODE_DISABLE;

    cmd_struct.dummy_cycles            = OSPI_DUMYC_CYCLES_0;
    cmd_struct.nbdata                  = 0;

    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);
}

/*!
    \brief      reset the flash
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
                prescaler: between 0 and 255
                fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
                sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
                device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
                cs_hightime: OSPI_CS_HIGH_TIME_x_CYCLE (x = 1, 2, ..., 63, 64)
                memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                             OSPI_MACRONIX_RAM_MODE,
                wrap_size: OSPI_DIRECT, OSPI_WRAP_16BYTES, OSPI_WRAP_32BYTES
                           OSPI_WRAP_64BYTES, OSPI_WRAP_128BYTES
                delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
    \param[in]  mode: flash interface mode
                only one parameter can be selected which is shown as below:
      \arg        SPI_MODE: SPI mode
      \arg        OSPI_MODE: OSPI mode
    \param[out] none
    \retval     none
*/
void ospi_flash_reset_memory(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, interface_mode mode)
{
    ospi_regular_cmd_struct cmd_struct = {0};

    /* initialize flash reset command */
    cmd_struct.operation_type          = OSPI_OPTYPE_COMMON_CFG;
    cmd_struct.instruction             = GD25LX512ME_RESET_MEMORY_CMD;

    /* initialize flash reset command */
    if(SPI_MODE == mode) {
        cmd_struct.ins_mode = OSPI_INSTRUCTION_1_LINE;
    } else {
        cmd_struct.ins_mode = OSPI_INSTRUCTION_8_LINES;
    }

    cmd_struct.ins_size                = OSPI_INSTRUCTION_8_BITS;

    cmd_struct.addr_mode               = OSPI_ADDRESS_NONE;
    cmd_struct.addr_size               = OSPI_ADDRESS_24_BITS;
    cmd_struct.addr_dtr_mode           = OSPI_ADDRDTR_MODE_DISABLE;

