burakenez/gd32h7xx-cmake-vscode/Examples/RTDEC/OSPI_data_read_with_RTDEC/Application/Core/Src/ospi_operation.c
    cmd_struct.data_mode               = OSPI_DATA_NONE;
    cmd_struct.data_dtr_mode           = OSPI_DADTR_MODE_DISABLE;

    cmd_struct.dummy_cycles            = OSPI_DUMYC_CYCLES_0;
    cmd_struct.nbdata                  = 0;

    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);

    /* Configure automatic polling mode to wait for write enabling */
    cmd_struct.instruction              = GD25LX512ME_READ_STATUS_REG_CMD;
    cmd_struct.data_mode                = OSPI_DATA_1_LINE;
    cmd_struct.data_dtr_mode            = OSPI_DADTR_MODE_DISABLE;
    cmd_struct.dummy_cycles             = OSPI_DUMYC_CYCLES_0;
    cmd_struct.nbdata                   = 1U;

    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);

    autopl_cfg_struct.match            = 2U;
    autopl_cfg_struct.mask             = 2U;
    autopl_cfg_struct.match_mode       = OSPI_MATCH_MODE_AND;
    autopl_cfg_struct.interval         = GD25LX512ME_AUTOPOLLING_INTERVAL_TIME;
    autopl_cfg_struct.automatic_stop   = OSPI_AUTOMATIC_STOP_MATCH;

    ospi_autopolling_mode(ospi_periph, ospi_struct, &autopl_cfg_struct);
}

/*!
    \brief      erase flash sector
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
                prescaler: between 0 and 255
                fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
                sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
                device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
                cs_hightime: OSPI_CS_HIGH_TIME_x_CYCLE (x = 1, 2, ..., 63, 64)
                memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                             OSPI_MACRONIX_RAM_MODE,
                wrap_size: OSPI_DIRECT, OSPI_WRAP_16BYTES, OSPI_WRAP_32BYTES
                           OSPI_WRAP_64BYTES, OSPI_WRAP_128BYTES
                delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
    \param[in]  sector_addr: sector address to erase
    \param[out] none
    \retval     none
*/
void ospi_flash_sector_erase(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, uint32_t sector_addr)
{
    ospi_regular_cmd_struct cmd_struct = {0};

    /* initialize erase sector command */
    cmd_struct.operation_type          = OSPI_OPTYPE_COMMON_CFG;
    cmd_struct.instruction             = GD25LX512ME_SECTOR_ERASE_4K_CMD;

    cmd_struct.ins_mode                = OSPI_INSTRUCTION_1_LINE;
    cmd_struct.ins_size                = OSPI_INSTRUCTION_8_BITS;

    cmd_struct.address                 = sector_addr;
    cmd_struct.addr_mode               = OSPI_ADDRESS_1_LINE;
    cmd_struct.addr_size               = OSPI_ADDRESS_24_BITS;
    cmd_struct.addr_dtr_mode           = OSPI_ADDRDTR_MODE_DISABLE;

    cmd_struct.alter_bytes_mode        = OSPI_ALTERNATE_BYTES_NONE;
    cmd_struct.alter_bytes_size        = OSPI_ALTERNATE_BYTES_24_BITS;
    cmd_struct.alter_bytes_dtr_mode    = OSPI_ABDTR_MODE_DISABLE;

    cmd_struct.data_mode               = OSPI_DATA_NONE;
    cmd_struct.data_dtr_mode           = OSPI_DADTR_MODE_DISABLE;

    cmd_struct.dummy_cycles            = OSPI_DUMYC_CYCLES_0;
    cmd_struct.nbdata                  = 0;

    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);
}

/*!
    \brief      program flash page
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
                prescaler: between 0 and 255
                fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
                sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
                device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
                cs_hightime: OSPI_CS_HIGH_TIME_x_CYCLE (x = 1, 2, ..., 63, 64)
                memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                             OSPI_MACRONIX_RAM_MODE,
                wrap_size: OSPI_DIRECT, OSPI_WRAP_16BYTES, OSPI_WRAP_32BYTES
                           OSPI_WRAP_64BYTES, OSPI_WRAP_128BYTES
                delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
    \param[in]  write_addr: start address to write
    \param[in]  datasize: size of data to write
    \param[in]  pdata: pointer to data to be written
    \param[out] none
    \retval     none
*/
void ospi_flash_page_program(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct, uint32_t write_addr, uint32_t datasize, uint8_t *pdata)
{
    ospi_regular_cmd_struct cmd_struct = {0};

    /* initialize page program command */
    cmd_struct.operation_type          = OSPI_OPTYPE_COMMON_CFG;
    cmd_struct.instruction             = GD25LX512ME_PAGE_PROG_CMD;

    cmd_struct.ins_mode                = OSPI_INSTRUCTION_1_LINE;
    cmd_struct.ins_size                = OSPI_INSTRUCTION_8_BITS;

    cmd_struct.address                 = write_addr;
    cmd_struct.addr_mode               = OSPI_ADDRESS_1_LINE;
    cmd_struct.addr_size               = OSPI_ADDRESS_24_BITS;
    cmd_struct.addr_dtr_mode           = OSPI_ADDRDTR_MODE_DISABLE;

    cmd_struct.alter_bytes_mode        = OSPI_ALTERNATE_BYTES_NONE;
    cmd_struct.alter_bytes_size        = OSPI_ALTERNATE_BYTES_24_BITS;
    cmd_struct.alter_bytes_dtr_mode    = OSPI_ABDTR_MODE_DISABLE;

