burakenez/gd32h7xx-cmake-vscode/Examples/RTDEC/OSPI_data_read_with_RTDEC/Application/Core/Src/ospi_operation.c
    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);

    /* transmit the data */
    ospi_transmit(ospi_periph, &value);
}

/*!
    \brief      enable memory mapped mode for the OSPI memory
    \param[in]  ospi_periph: OSPIx(x=0,1)
    \param[in]  ospi_struct: OSPI parameter initialization stuct members of the structure
                             and the member values are shown as below:
                prescaler: between 0 and 255
                fifo_threshold: OSPI_FIFO_THRESHOLD_x (x = 1, 2, ..., 31, 32)
                sample_shift: OSPI_SAMPLE_SHIFTING_NONE, OSPI_SAMPLE_SHIFTING_HALF_CYCLE
                device_size: OSPI_MESZ_x_BYTES (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_KBS (x = 2, 4, 8, ..., 512, 1024)
                             OSPI_MESZ_x_MBS (x = 2, 4, 8, ..., 2048, 4096)
                cs_hightime: OSPI_CS_HIGH_TIME_x_CYCLE (x = 1, 2, ..., 63, 64)
                memory_type: OSPI_MICRON_MODE, OSPI_MACRONIX_MODE, OSPI_STANDARD_MODE
                             OSPI_MACRONIX_RAM_MODE,
                wrap_size: OSPI_DIRECT, OSPI_WRAP_16BYTES, OSPI_WRAP_32BYTES
                           OSPI_WRAP_64BYTES, OSPI_WRAP_128BYTES
                delay_hold_cycle: OSPI_DELAY_HOLD_NONE, OSPI_DELAY_HOLD_QUARTER_CYCLE
    \param[out] none
    \retval     none
*/
void ospi_memory_map_enable(uint32_t ospi_periph, ospi_parameter_struct *ospi_struct)
{
    ospi_regular_cmd_struct cmd_struct = {0};

    /* initialize read command */
    cmd_struct.operation_type          = OSPI_OPTYPE_WRAP_CFG;
    cmd_struct.instruction             = GD25LX512ME_OCTAL_IO_FAST_READ_CMD;

    cmd_struct.ins_mode                = OSPI_INSTRUCTION_8_LINES;
    cmd_struct.ins_size                = OSPI_INSTRUCTION_8_BITS;

    cmd_struct.address                 = 0U;
    cmd_struct.addr_mode               = OSPI_ADDRESS_8_LINES;
    cmd_struct.addr_size               = OSPI_ADDRESS_24_BITS;

    cmd_struct.alter_bytes_mode        = OSPI_ALTERNATE_BYTES_NONE;
    cmd_struct.alter_bytes_size        = OSPI_ALTERNATE_BYTES_24_BITS;
    cmd_struct.alter_bytes_dtr_mode    = OSPI_ABDTR_MODE_DISABLE;

    cmd_struct.data_mode               = OSPI_DATA_8_LINES;
    cmd_struct.data_dtr_mode           = OSPI_DADTR_MODE_DISABLE;

    cmd_struct.dummy_cycles            = OSPI_DUMYC_CYCLES_16;
    cmd_struct.nbdata                  = 0;

    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);

    /* initialize the program command */
    cmd_struct.operation_type          = OSPI_OPTYPE_WRITE_CFG;
    cmd_struct.instruction             = GD25LX512ME_EXT_OCTAL_PAGE_PROG_CMD;
    cmd_struct.dummy_cycles            = 0U;

    /* configure the command */
    ospi_command_config(ospi_periph, ospi_struct, &cmd_struct);

    while(RESET != ospi_flag_get(ospi_periph, OSPI_FLAG_BUSY)) {
    }
    ospi_functional_mode_config(ospi_periph, OSPI_MEMORY_MAPPED);
}
